// Feito em dupla Jeferson Korte Junior RA 2651114 e Bruno Alcantara RA 2677156

/*

/////////////////////////////////////////////////////////////////////////////
// A //
///////

                30
             /     \
           20       45
          /  \     /  \
        10    25  37   50
                 / \     \
                35 40    70
               /  \  \
              32  36  42
                        \
                         47
                          
Após 50, 30, 20 → rotação simples à direita em 50

Após 35, 37 → rotação dupla em 50 (esq-dir)

Após 38 → rotação simples à esquerda em 35

Após 42, 47 → rotação simples à esquerda em 45

/////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////
// B //
///////

                       60
                     /    \  
                  /          \
                40           80
              /    \       /     \
            30     50     70      100
           /  \   /  \   /  \
          20  35 45  55 65  75
                           /  \
                          73  77


Após 100, 80, 60 → rotação simples à direita em 100

Após 40, 20, 30 → rotação dupla em 60 (esq-dir)

Após 50, 35, 45, 55 → rotações à direita para balancear 40

Após 70, 65, 75 → rotação esquerda em 80

Após 73, 77 → rotação esquerda em 75

/////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////
// C //
///////

               31
             /    \
           19      38
         /   \        \
       12    27       41
      /                  \
     8                   49

Após 41, 38, 31 → rotação simples à direita em 41

Após 12, 19 → rotação dupla esquerda-direita em 31

Após 49 → rotação simples à esquerda em 41

/////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////////////////////////////////////////////
// D //
///////

               17
             /    \
           15      21
         /   \    /
       10   16  19
                  \
                  20

Após 10, 21, 15 → rotação dupla em 21

Após 17, 16 → rotação dupla em 15

Após 19, 20 → rotação simples à esquerda em 17

/////////////////////////////////////////////////////////////////////////////

*/